service_ticket_tracker/app/views/tickets/_form.html.erb

SELECT "users".* FROM "users" ORDER BY "users"."username" ASC, "users"."id" ASC
---
      <%= form.label :assigned_to, "Assigned user", class: "mb-1 block text-sm font-medium text-gray-300" %>
      <%= form.select :assigned_to,
                      options_from_collection_for_select(@users || User.order(:username, :id), :id, :username, ticket.assigned_to),
                      { include_blank: "Unassigned" },
                      class: "block w-full rounded-md border-gray-700 bg-gray-800 text-gray-100" %>