service_ticket_tracker/app/views/tickets/board.html.erb

SELECT "tickets".* FROM "tickets" ORDER BY position IS NULL, position ASC, "tickets"."created_at" ASC
---
    // Intercept clicks inside modal for links marked for modal flow
    document.getElementById("ticket-modal-body").addEventListener("click", function(e) {
        const a = e.target.closest("a");
        if (!a) return;
        const isModalLink = a.dataset.modal === "1" || (a.getAttribute("href") || "").includes("modal=1");
        if (!isModalLink) return;

        e.preventDefault();
        fetch(a.href, { headers: { "X-Requested-With": "XMLHttpRequest", "Accept": "text/html" }})
            .then(r => r.text())
            .then(html => openModal(html))
            .catch(() => showBoardError("Failed to load"));
    });