service_ticket_tracker/app/views/tickets/index.html.erb

SELECT "tickets".* FROM "tickets" ORDER BY "tickets"."created_at" DESC
---
    <label class="block text-xs font-medium text-gray-300 mb-1">Priority</label>
    <%= f.select :priority, [["Any", ""], *Ticket.priorities.keys.map { |k| [k.humanize, k] }], {}, class: "block w-full rounded-md border-gray-700 bg-gray-800 text-sm text-gray-100" %>

SELECT "tickets".* FROM "tickets" ORDER BY "tickets"."created_at" DESC
---
    <label class="block text-xs font-medium text-gray-300 mb-1">Stage</label>
    <%= f.select :stage, [["Any", ""], *Ticket.stages.keys.map { |k| [k.humanize, k] }], {}, class: "block w-full rounded-md border-gray-700 bg-gray-800 text-sm text-gray-100" %>