service_ticket_tracker/app/controllers/tickets_controller.rb

SELECT "tickets".* FROM "tickets"
---
class TicketsController < ApplicationController
  # ... existing code ...
  # Load the ticket only for member routes (those that have :id)
  before_action :set_ticket, if: -> { params[:id].present? }

SELECT "tickets".* FROM "tickets"
---
  def board
    @tickets_by_stage = Ticket.all.group_by(&:stage)

UPDATE "tickets" SET "updated_at" = '2025-09-04 23:43:36.880897', "stage" = 'not_scheduled' WHERE "tickets"."id" = 1
---
  def update_stage
    # @ticket is set by before_action
    new_stage = params.require(:stage)

    unless Ticket.stages.key?(new_stage)
      return respond_to do |format|
        format.json { render json: { error: "Invalid stage" }, status: :unprocessable_entity }
        format.html { redirect_to board_tickets_path, alert: "Invalid stage" }
      end
    end

    if @ticket.update(stage: new_stage)