service_ticket_tracker/app/controllers/tickets_controller.rb

INSERT INTO "tickets" ("account_name", "city", "contact_person", "contact_info", "priority", "work_type", "lease", "under_warranty", "machine_model_or_type", "issue_description", "requesting_tech_name", "assigned_to", "created_at", "updated_at") VALUES ('test account ', 'NSB', 'MOD', 'MOD', 'low', NULL, TRUE, FALSE, 'cma stand up', 'not working when filling with water', 'Andrew', NULL, '2025-09-04 23:01:34.818317', '2025-09-04 23:01:34.818317') RETURNING "id"
---
  def create
    @ticket = Ticket.new(ticket_params)
    if @ticket.save

UPDATE "tickets" SET "updated_at" = '2025-09-05 01:41:35.395442', "position" = 2 WHERE "tickets"."id" = 2
---
  def update_stage
    old_stage = @ticket.stage
    new_stage = params.require(:stage)
    position  = params[:position].presence&.to_i

    unless Ticket.stages.key?(new_stage)
      return respond_to do |format|
        format.json { render json: { error: "Invalid stage" }, status: :unprocessable_entity }
        format.html { redirect_to board_tickets_path, alert: "Invalid stage" }
      end
    end

    Ticket.transaction do
      @ticket.update!(stage: new_stage, position: position)