service_ticket_tracker/app/controllers/tickets_controller.rb

SELECT "tickets".* FROM "tickets" ORDER BY "tickets"."created_at" DESC
SELECT "tickets".* FROM "tickets" WHERE "tickets"."stage" = 'not_scheduled' ORDER BY "tickets"."created_at" DESC
SELECT "tickets".* FROM "tickets" WHERE "tickets"."under_warranty" = TRUE ORDER BY "tickets"."created_at" DESC
---
  def index
    @tickets = Ticket.order(created_at: :desc)

    if params[:priority].present?
      @tickets = @tickets.where(priority: params[:priority])
    end
    if params[:stage].present?
      @tickets = @tickets.where(stage: params[:stage])
    end
    unless params[:under_warranty].to_s.blank?
      bool = ActiveModel::Type::Boolean.new.cast(params[:under_warranty])
      @tickets = @tickets.where(under_warranty: bool)

SELECT "tickets".* FROM "tickets" ORDER BY position IS NULL, position ASC, "tickets"."created_at" ASC
---
  def board
    # Order by position (NULLS LAST), then created_at as a fallback
    ordered = Ticket.order(Arel.sql("position IS NULL, position ASC"), :created_at)
    @tickets_by_stage = ordered.group_by { |t| t.stage.presence || "not_scheduled" }

INSERT INTO "tickets" ("account_name", "city", "contact_person", "contact_info", "priority", "work_type", "lease", "under_warranty", "machine_model_or_type", "issue_description", "requesting_tech_name", "assigned_to", "created_at", "updated_at", "stage", "completed_at", "position", "scheduled_date") VALUES ('install test', 'nsb', '', '', 'low', 'install', FALSE, FALSE, '', '', '', NULL, '2025-09-05 02:21:41.235139', '2025-09-05 02:21:41.235139', 'not_scheduled', NULL, NULL, NULL) RETURNING "id"
---
  def create
    @ticket = Ticket.new(ticket_params)
    if @ticket.save

UPDATE "tickets" SET "updated_at" = '2025-09-05 02:18:35.203520', "scheduled_date" = '2025-09-04' WHERE "tickets"."id" = 2
---
  def update
    if @ticket.update(ticket_params)

UPDATE "tickets" SET "updated_at" = '2025-09-05 01:58:40.443028', "stage" = 'not_scheduled', "position" = 2 WHERE "tickets"."id" = 3
---
  def update_stage
    old_stage = @ticket.stage
    new_stage = params.require(:stage)
    position  = params[:position].presence&.to_i

    unless Ticket.stages.key?(new_stage)
      return respond_to do |format|
        format.json { render json: { error: "Invalid stage" }, status: :unprocessable_entity }
        format.html { redirect_to board_tickets_path, alert: "Invalid stage" }
      end
    end

    Ticket.transaction do
      @ticket.update!(stage: new_stage, position: position)

SELECT "users".* FROM "users" ORDER BY "users"."username" ASC, "users"."id" ASC
---
  def set_users
    @users = User.order(:username, :id)

SELECT "tickets".* FROM "tickets" WHERE "tickets"."stage" = 'install_removal' ORDER BY position IS NULL, position ASC, "tickets"."updated_at" ASC, "tickets"."created_at" ASC
UPDATE "tickets" SET "position" = 1 WHERE "tickets"."id" = 2
---
  def normalize_stage_positions!(stage)
    return if stage.blank?
    list = Ticket.where(stage: stage).order(Arel.sql("position IS NULL, position ASC"), :updated_at, :created_at)
    list.each_with_index do |t, idx|
      new_pos = idx + 1
      t.update_column(:position, new_pos) if t.position != new_pos