service_ticket_tracker/app/controllers/ticket_updates_controller.rb

SELECT "tickets".* FROM "tickets" WHERE "tickets"."id" = 1 LIMIT 1
INSERT INTO "ticket_updates" ("ticket_id", "user_name", "content", "created_at", "updated_at") VALUES (1, 'Andrew', 'test update', '2025-09-05 00:41:11.226020', '2025-09-05 00:41:11.226020') RETURNING "id"
---
  def create
    ticket = Ticket.find(params[:ticket_id])
    update = ticket.ticket_updates.build(ticket_update_params)
    if update.save

SELECT "ticket_updates".* FROM "ticket_updates" WHERE "ticket_updates"."id" = 1 LIMIT 1
DELETE FROM "ticket_updates" WHERE "ticket_updates"."id" = 1
---
  def destroy
    update = TicketUpdate.find(params[:id])
    ticket = update.ticket
    update.destroy