service_ticket_tracker/app/controllers/users_controller.rb

  def index
    @users = User.all
---
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("username", "password_digest", "created_at", "updated_at") VALUES ('Justin', NULL, '2025-09-05 01:26:20.944347', '2025-09-05 01:26:20.944347') RETURNING "id"